# CircuitLoadCalculationMethod Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElectricalSetting..::..CircuitLoadCalculationMethod Property
ElectricalSetting Class See Also
---
The method to calculate circuit load
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public CircuitLoadCalculationMethod CircuitLoadCalculationMethod { get; set; }
```

Visual Basic
---
```text
Public Property CircuitLoadCalculationMethod As CircuitLoadCalculationMethod
	Get
	Set
```

Visual C++
---
```text
public:
property CircuitLoadCalculationMethod CircuitLoadCalculationMethod {
	CircuitLoadCalculationMethod get ();
	void set (CircuitLoadCalculationMethod value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
ElectricalSetting Class
Autodesk.Revit.DB.Electrical Namespace